TMS320C6x Assembler PC v7.4.18 Thu Nov 07 11:18:03 2019

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\INPT\AppData\Local\Temp\0049610                             PAGE    1

       1                    ;******************************************************************************
       2                    ;* TMS320C6x C/C++ Codegen                                         PC v7.4.18 *
       3                    ;* Date/Time created: Thu Nov 07 11:18:03 2019                                *
       4                    ;******************************************************************************
       5                            .compiler_opts --abi=coffabi --c64p_l1d_workaround=default --endian=little --hll_source=on --l
       6                    
       7                    ;******************************************************************************
       8                    ;* GLOBAL FILE PARAMETERS                                                     *
       9                    ;*                                                                            *
      10                    ;*   Architecture      : TMS320C671x                                          *
      11                    ;*   Optimization      : Enabled at level 1                                   *
      12                    ;*   Optimizing for    : Compile time 1st, speed 2nd                          *

TMS320C6x Assembler PC v7.4.18 Thu Nov 07 11:18:03 2019

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\INPT\AppData\Local\Temp\0049610                             PAGE   24

    1266                    ;** --------------------------------------------------------------------------*
    1267 0000057c           $C$L12:    
    1268                            .dwpsn  file "C:/ti/CCCStudio_v3.1/C6000/csl/include/csl_mcbsp.h",line 221,column 3,is_stmt
    1269 0000057c 01800028!            MVKL    .S1     _DSK6713_AIC23_codecdatahandle,A3
    1270 00000580 01800068!            MVKH    .S1     _DSK6713_AIC23_codecdatahandle,A3
    1271 00000584 018C0264             LDW     .D1T1   *A3,A3            ; |221| 
    1272 00000588 00006000             NOP             4
    1273 0000058c 018C8264             LDW     .D1T1   *+A3(16),A3       ; |221| 
    1274 00000590 00006000             NOP             4
    1275 00000594 018C0264             LDW     .D1T1   *A3,A3            ; |221| 
    1276 00000598 00002000             NOP             2
    1277                            .dwpsn  file "../c6713dskinit.c",line 105,column 3,is_stmt
    1278 0000059c 0200002A-            MVKL    .S2     _AIC_data,B4
    1279 000005a0 0200006A-            MVKH    .S2     _AIC_data,B4
    1280 000005a4 019002F4             STW     .D2T1   A3,*B4            ; |105| 
    1281                            .dwpsn  file "../c6713dskinit.c",line 106,column 2,is_stmt
    1282 000005a8 021002C4             LDH     .D2T1   *B4,A4            ; |106| 
    1283                            .dwpsn  file "../c6713dskinit.c",line 107,column 1,is_stmt
    1284                            .dwcfi  cfa_offset, 0
    1285                    $C$DW$77        .dwtag  DW_TAG_TI_branch
    1286                            .dwattr $C$DW$77, DW_AT_low_pc(0x00)
    1287                            .dwattr $C$DW$77, DW_AT_TI_return
    1288 000005ac 000C0362             RET     .S2     B3                ; |107| 
    1289 000005b0 00008000             NOP             5
    1290                               ; BRANCH OCCURS {B3}              ; |107| 
    1291                    
    1292                    $C$DW$78        .dwtag  DW_TAG_TI_loop
    1293                            .dwattr $C$DW$78, DW_AT_name("C:\\Users\\INPT\\AppData\\Local\\Temp\\0049610:$C$L11:1:15731218
    1294                            .dwattr $C$DW$78, DW_AT_TI_begin_file("C:/ti/CCCStudio_v3.1/C6000/csl/include/csl_mcbsp.h")
    1295                            .dwattr $C$DW$78, DW_AT_TI_begin_line(0x68)
    1296                            .dwattr $C$DW$78, DW_AT_TI_end_line(0xe9)
    1297                    $C$DW$79        .dwtag  DW_TAG_TI_loop_range
    1298                            .dwattr $C$DW$79, DW_AT_low_pc($C$DW$L$_input_right_sample$2$B)
    1299                            .dwattr $C$DW$79, DW_AT_high_pc($C$DW$L$_input_right_sample$2$E)
    1300                            .dwendtag $C$DW$78
    1301                    
    1302                            .dwattr $C$DW$76, DW_AT_TI_end_file("../c6713dskinit.c")
    1303                            .dwattr $C$DW$76, DW_AT_TI_end_line(0x6b)
    1304                            .dwattr $C$DW$76, DW_AT_TI_end_column(0x01)
    1305                            .dwendentry
    1306                            .dwendtag $C$DW$76
    1307                    
    1308                    ;*****************************************************************************
    1309                    ;* UNDEFINED EXTERNAL REFERENCES                                             *
    1310                    ;*****************************************************************************
    1311                            .global _IRQ_map
    1312                            .global _DSK6713_init
    1313                            .global _MCBSP_start
    1314                            .global _DSK6713_AIC23_openCodec
    1315                            .global _DSK6713_AIC23_setFreq
    1316                            .global __IRQ_eventTable
    1317                            .global _DSK6713_AIC23_codecdatahandle
    1318                            .global _fs
    1319                    
    1320                    ;******************************************************************************
TMS320C6x Assembler PC v7.4.18 Thu Nov 07 11:18:03 2019

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\INPT\AppData\Local\Temp\0049610                             PAGE   25

    1321                    ;* BUILD ATTRIBUTES                                                           *
    1322                    ;******************************************************************************
    1323                            .battr "TI", Tag_File, 1, Tag_ABI_stack_align_needed(0)
    1324                            .battr "TI", Tag_File, 1, Tag_ABI_stack_align_preserved(0)
    1325                            .battr "TI", Tag_File, 1, Tag_Tramps_Use_SOC(0)
    1326                    
    1327                    ;******************************************************************************
    1328                    ;* TYPE INFORMATION                                                           *
    1329                    ;******************************************************************************
    1330                    
    1331                    $C$DW$T$22      .dwtag  DW_TAG_structure_type
    1332                            .dwattr $C$DW$T$22, DW_AT_byte_size(0x18)
    1333                    $C$DW$80        .dwtag  DW_TAG_member
    1334                            .dwattr $C$DW$80, DW_AT_type(*$C$DW$T$19)
    1335                            .dwattr $C$DW$80, DW_AT_name("allocated")
    1336                            .dwattr $C$DW$80, DW_AT_TI_symbol_name("_allocated")
    1337                            .dwattr $C$DW$80, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1338                            .dwattr $C$DW$80, DW_AT_accessibility(DW_ACCESS_public)
    1339                    $C$DW$81        .dwtag  DW_TAG_member
    1340                            .dwattr $C$DW$81, DW_AT_type(*$C$DW$T$19)
    1341                            .dwattr $C$DW$81, DW_AT_name("xmtEventId")
    1342                            .dwattr $C$DW$81, DW_AT_TI_symbol_name("_xmtEventId")
    1343                            .dwattr $C$DW$81, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1344                            .dwattr $C$DW$81, DW_AT_accessibility(DW_ACCESS_public)
    1345                    $C$DW$82        .dwtag  DW_TAG_member
    1346                            .dwattr $C$DW$82, DW_AT_type(*$C$DW$T$19)
    1347                            .dwattr $C$DW$82, DW_AT_name("rcvEventId")
    1348                            .dwattr $C$DW$82, DW_AT_TI_symbol_name("_rcvEventId")
    1349                            .dwattr $C$DW$82, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1350                            .dwattr $C$DW$82, DW_AT_accessibility(DW_ACCESS_public)
    1351                    $C$DW$83        .dwtag  DW_TAG_member
    1352                            .dwattr $C$DW$83, DW_AT_type(*$C$DW$T$21)
    1353                            .dwattr $C$DW$83, DW_AT_name("baseAddr")
    1354                            .dwattr $C$DW$83, DW_AT_TI_symbol_name("_baseAddr")
    1355                            .dwattr $C$DW$83, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1356                            .dwattr $C$DW$83, DW_AT_accessibility(DW_ACCESS_public)
    1357                    $C$DW$84        .dwtag  DW_TAG_member
    1358                            .dwattr $C$DW$84, DW_AT_type(*$C$DW$T$19)
    1359                            .dwattr $C$DW$84, DW_AT_name("drrAddr")
    1360                            .dwattr $C$DW$84, DW_AT_TI_symbol_name("_drrAddr")
    1361                            .dwattr $C$DW$84, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    1362                            .dwattr $C$DW$84, DW_AT_accessibility(DW_ACCESS_public)
    1363                    $C$DW$85        .dwtag  DW_TAG_member
    1364                            .dwattr $C$DW$85, DW_AT_type(*$C$DW$T$19)
    1365                            .dwattr $C$DW$85, DW_AT_name("dxrAddr")
    1366                            .dwattr $C$DW$85, DW_AT_TI_symbol_name("_dxrAddr")
    1367                            .dwattr $C$DW$85, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    1368                            .dwattr $C$DW$85, DW_AT_accessibility(DW_ACCESS_public)
    1369                            .dwendtag $C$DW$T$22
    1370                    
    1371                    $C$DW$T$28      .dwtag  DW_TAG_pointer_type
    1372                            .dwattr $C$DW$T$28, DW_AT_type(*$C$DW$T$22)
    1373                            .dwattr $C$DW$T$28, DW_AT_address_class(0x20)
    1374                    $C$DW$T$29      .dwtag  DW_TAG_typedef, DW_AT_name("MCBSP_Handle")
    1375                            .dwattr $C$DW$T$29, DW_AT_type(*$C$DW$T$28)
TMS320C6x Assembler PC v7.4.18 Thu Nov 07 11:18:03 2019

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\INPT\AppData\Local\Temp\0049610                             PAGE   26

    1376                            .dwattr $C$DW$T$29, DW_AT_language(DW_LANG_C)
    1377                    
    1378                    $C$DW$T$23      .dwtag  DW_TAG_structure_type
    1379                            .dwattr $C$DW$T$23, DW_AT_byte_size(0x20)
    1380                    $C$DW$86        .dwtag  DW_TAG_member
    1381                            .dwattr $C$DW$86, DW_AT_type(*$C$DW$T$19)
    1382                            .dwattr $C$DW$86, DW_AT_name("spcr")
    1383                            .dwattr $C$DW$86, DW_AT_TI_symbol_name("_spcr")
    1384                            .dwattr $C$DW$86, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1385                            .dwattr $C$DW$86, DW_AT_accessibility(DW_ACCESS_public)
    1386                    $C$DW$87        .dwtag  DW_TAG_member
    1387                            .dwattr $C$DW$87, DW_AT_type(*$C$DW$T$19)
    1388                            .dwattr $C$DW$87, DW_AT_name("rcr")
    1389                            .dwattr $C$DW$87, DW_AT_TI_symbol_name("_rcr")
    1390                            .dwattr $C$DW$87, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1391                            .dwattr $C$DW$87, DW_AT_accessibility(DW_ACCESS_public)
    1392                    $C$DW$88        .dwtag  DW_TAG_member
    1393                            .dwattr $C$DW$88, DW_AT_type(*$C$DW$T$19)
    1394                            .dwattr $C$DW$88, DW_AT_name("xcr")
    1395                            .dwattr $C$DW$88, DW_AT_TI_symbol_name("_xcr")
    1396                            .dwattr $C$DW$88, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1397                            .dwattr $C$DW$88, DW_AT_accessibility(DW_ACCESS_public)
    1398                    $C$DW$89        .dwtag  DW_TAG_member
    1399                            .dwattr $C$DW$89, DW_AT_type(*$C$DW$T$19)
    1400                            .dwattr $C$DW$89, DW_AT_name("srgr")
    1401                            .dwattr $C$DW$89, DW_AT_TI_symbol_name("_srgr")
    1402                            .dwattr $C$DW$89, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1403                            .dwattr $C$DW$89, DW_AT_accessibility(DW_ACCESS_public)
    1404                    $C$DW$90        .dwtag  DW_TAG_member
    1405                            .dwattr $C$DW$90, DW_AT_type(*$C$DW$T$19)
    1406                            .dwattr $C$DW$90, DW_AT_name("mcr")
    1407                            .dwattr $C$DW$90, DW_AT_TI_symbol_name("_mcr")
    1408                            .dwattr $C$DW$90, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    1409                            .dwattr $C$DW$90, DW_AT_accessibility(DW_ACCESS_public)
    1410                    $C$DW$91        .dwtag  DW_TAG_member
    1411                            .dwattr $C$DW$91, DW_AT_type(*$C$DW$T$19)
    1412                            .dwattr $C$DW$91, DW_AT_name("rcer")
    1413                            .dwattr $C$DW$91, DW_AT_TI_symbol_name("_rcer")
    1414                            .dwattr $C$DW$91, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    1415                            .dwattr $C$DW$91, DW_AT_accessibility(DW_ACCESS_public)
    1416                    $C$DW$92        .dwtag  DW_TAG_member
    1417                            .dwattr $C$DW$92, DW_AT_type(*$C$DW$T$19)
    1418                            .dwattr $C$DW$92, DW_AT_name("xcer")
    1419                            .dwattr $C$DW$92, DW_AT_TI_symbol_name("_xcer")
    1420                            .dwattr $C$DW$92, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    1421                            .dwattr $C$DW$92, DW_AT_accessibility(DW_ACCESS_public)
    1422                    $C$DW$93        .dwtag  DW_TAG_member
    1423                            .dwattr $C$DW$93, DW_AT_type(*$C$DW$T$19)
    1424                            .dwattr $C$DW$93, DW_AT_name("pcr")
    1425                            .dwattr $C$DW$93, DW_AT_TI_symbol_name("_pcr")
    1426                            .dwattr $C$DW$93, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    1427                            .dwattr $C$DW$93, DW_AT_accessibility(DW_ACCESS_public)
    1428                            .dwendtag $C$DW$T$23
    1429                    
    1430                    $C$DW$T$30      .dwtag  DW_TAG_typedef, DW_AT_name("MCBSP_Config")
TMS320C6x Assembler PC v7.4.18 Thu Nov 07 11:18:03 2019

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\INPT\AppData\Local\Temp\0049610                             PAGE   27

    1431                            .dwattr $C$DW$T$30, DW_AT_type(*$C$DW$T$23)
    1432                            .dwattr $C$DW$T$30, DW_AT_language(DW_LANG_C)
    1433                    
    1434                    $C$DW$T$25      .dwtag  DW_TAG_union_type
    1435                            .dwattr $C$DW$T$25, DW_AT_byte_size(0x04)
    1436                    $C$DW$94        .dwtag  DW_TAG_member
    1437                            .dwattr $C$DW$94, DW_AT_type(*$C$DW$T$19)
    1438                            .dwattr $C$DW$94, DW_AT_name("uint")
    1439                            .dwattr $C$DW$94, DW_AT_TI_symbol_name("_uint")
    1440                            .dwattr $C$DW$94, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1441                            .dwattr $C$DW$94, DW_AT_accessibility(DW_ACCESS_public)
    1442                    $C$DW$95        .dwtag  DW_TAG_member
    1443                            .dwattr $C$DW$95, DW_AT_type(*$C$DW$T$24)
    1444                            .dwattr $C$DW$95, DW_AT_name("channel")
    1445                            .dwattr $C$DW$95, DW_AT_TI_symbol_name("_channel")
    1446                            .dwattr $C$DW$95, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1447                            .dwattr $C$DW$95, DW_AT_accessibility(DW_ACCESS_public)
    1448                            .dwendtag $C$DW$T$25
    1449                    
    1450                    
    1451                    $C$DW$T$27      .dwtag  DW_TAG_structure_type
    1452                            .dwattr $C$DW$T$27, DW_AT_name("DSK6713_AIC23_Config")
    1453                            .dwattr $C$DW$T$27, DW_AT_byte_size(0x28)
    1454                    $C$DW$96        .dwtag  DW_TAG_member
    1455                            .dwattr $C$DW$96, DW_AT_type(*$C$DW$T$26)
    1456                            .dwattr $C$DW$96, DW_AT_name("regs")
    1457                            .dwattr $C$DW$96, DW_AT_TI_symbol_name("_regs")
    1458                            .dwattr $C$DW$96, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1459                            .dwattr $C$DW$96, DW_AT_accessibility(DW_ACCESS_public)
    1460                            .dwendtag $C$DW$T$27
    1461                    
    1462                    $C$DW$T$33      .dwtag  DW_TAG_typedef, DW_AT_name("DSK6713_AIC23_Config")
    1463                            .dwattr $C$DW$T$33, DW_AT_type(*$C$DW$T$27)
    1464                            .dwattr $C$DW$T$33, DW_AT_language(DW_LANG_C)
    1465                    $C$DW$T$34      .dwtag  DW_TAG_pointer_type
    1466                            .dwattr $C$DW$T$34, DW_AT_type(*$C$DW$T$33)
    1467                            .dwattr $C$DW$T$34, DW_AT_address_class(0x20)
    1468                    $C$DW$T$4       .dwtag  DW_TAG_base_type
    1469                            .dwattr $C$DW$T$4, DW_AT_encoding(DW_ATE_boolean)
    1470                            .dwattr $C$DW$T$4, DW_AT_name("bool")
    1471                            .dwattr $C$DW$T$4, DW_AT_byte_size(0x01)
    1472                    $C$DW$T$5       .dwtag  DW_TAG_base_type
    1473                            .dwattr $C$DW$T$5, DW_AT_encoding(DW_ATE_signed_char)
    1474                            .dwattr $C$DW$T$5, DW_AT_name("signed char")
    1475                            .dwattr $C$DW$T$5, DW_AT_byte_size(0x01)
    1476                    $C$DW$T$6       .dwtag  DW_TAG_base_type
    1477                            .dwattr $C$DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
    1478                            .dwattr $C$DW$T$6, DW_AT_name("unsigned char")
    1479                            .dwattr $C$DW$T$6, DW_AT_byte_size(0x01)
    1480                    $C$DW$T$7       .dwtag  DW_TAG_base_type
    1481                            .dwattr $C$DW$T$7, DW_AT_encoding(DW_ATE_signed_char)
    1482                            .dwattr $C$DW$T$7, DW_AT_name("wchar_t")
    1483                            .dwattr $C$DW$T$7, DW_AT_byte_size(0x02)
    1484                    $C$DW$T$8       .dwtag  DW_TAG_base_type
    1485                            .dwattr $C$DW$T$8, DW_AT_encoding(DW_ATE_signed)
TMS320C6x Assembler PC v7.4.18 Thu Nov 07 11:18:03 2019

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\INPT\AppData\Local\Temp\0049610                             PAGE   28

    1486                            .dwattr $C$DW$T$8, DW_AT_name("short")
    1487                            .dwattr $C$DW$T$8, DW_AT_byte_size(0x02)
    1488                    
    1489                    $C$DW$T$24      .dwtag  DW_TAG_array_type
    1490                            .dwattr $C$DW$T$24, DW_AT_type(*$C$DW$T$8)
    1491                            .dwattr $C$DW$T$24, DW_AT_language(DW_LANG_C)
    1492                            .dwattr $C$DW$T$24, DW_AT_byte_size(0x04)
    1493                    $C$DW$97        .dwtag  DW_TAG_subrange_type
    1494                            .dwattr $C$DW$97, DW_AT_upper_bound(0x01)
    1495                            .dwendtag $C$DW$T$24
    1496                    
    1497                    $C$DW$T$53      .dwtag  DW_TAG_const_type
    1498                            .dwattr $C$DW$T$53, DW_AT_type(*$C$DW$T$8)
    1499                    $C$DW$T$9       .dwtag  DW_TAG_base_type
    1500                            .dwattr $C$DW$T$9, DW_AT_encoding(DW_ATE_unsigned)
    1501                            .dwattr $C$DW$T$9, DW_AT_name("unsigned short")
    1502                            .dwattr $C$DW$T$9, DW_AT_byte_size(0x02)
    1503                    $C$DW$T$10      .dwtag  DW_TAG_base_type
    1504                            .dwattr $C$DW$T$10, DW_AT_encoding(DW_ATE_signed)
    1505                            .dwattr $C$DW$T$10, DW_AT_name("int")
    1506                            .dwattr $C$DW$T$10, DW_AT_byte_size(0x04)
    1507                    $C$DW$T$45      .dwtag  DW_TAG_typedef, DW_AT_name("DSK6713_AIC23_CodecHandle")
